Import all packages needed

In [2]:
import pandas as pd
import sqlite3

Ingest Step

In [5]:
# Read Excel file
people_df = pd.read_excel("people_pets_db.xlsx", sheet_name="People")
pets_df = pd.read_excel("people_pets_db.xlsx", sheet_name="Pets")
pets_df

        Pets
0     Potato
1     Pickle
2    Pancake
3     Mortie
4     Malfoy
5        Ned
6   Callahan
7     Maizer
8    Kringle
9     Birdie
10    Wiggly

In [6]:
# usecols returns a subset of columns
people_df = pd.read_excel("people_pets_db.xlsx", sheet_name="People")
pets_df = pd.read_excel("people_pets_db.xlsx", sheet_name="Pets", usecols="N", skiprows=19)
pets_df

        Pets
0     Potato
1     Pickle
2    Pancake
3     Mortie
4     Malfoy
5        Ned
6   Callahan
7     Maizer
8    Kringle
9     Birdie
10    Wiggly

Now read our pet show spreadsheet and put data into database

In [7]:
Owners_df = pd.read_excel("pet_show.xlsx", sheet_name="Attendees", usecols="C:D", skiprows=3)
Owners_df

  First_Name  Last_Name
0      Katie      Brown
1      David      Brown
2      Shane    Cornell
3      Megan  Macdonald
4    Dorothy   Martinez
5       John       Funk
6       Newb  nubertson

In [8]:
Owners_and_pets_df = pd.read_excel("pet_show.xlsx", sheet_name="Owners_and_pets", usecols="C:D", skiprows=3)
Owners_and_pets_df

   Owner_name  Pet_name
0       Katie    Potato
1       Katie    Pickle
2       David   Pancake
3       David    Mortie
4       Katie    Malfoy
5       David       Ned
6       Shane  Callahan
7        John    Maizer
8     Dorothy   Kringle
9       David    Birdie
10       Newb    Wiggly

Insert owners into a table in a sql database

Create or open database file (can create a file but not a folder structure)

In [12]:
# connection
conn = sqlite3.connect('data\\pet_show.db')
# cursor object
cur = conn.cursor()

In [13]:
# create the attendees table
cur.execute('''CREATE TABLE attendees
             (First_name, Last_name)''')

In [14]:
# create the owners and pets table
cur.execute('''CREATE TABLE owners_and_pets
             (Owner_name, Pet_name)''')

Now add data to the tables using pandas

In [16]:
 Owners_df.to_sql('attendees',  if_exists='replace', con=conn)

In [18]:
Owners_and_pets_df.to_sql('owners_and_pets',  if_exists='replace', con=conn)

In [20]:
# close the database  and flush stuff to disk
conn.commit()
conn.close()

Now manipulate the data!